{
  "commands.category": "ပုံနှိပ်ခြင်း",
  "commands.title.help": "လက်စွဲစာအုပ်ကိုဖွင့်ပါ",
  "commands.title.openLog": "မှတ်တမ်းဖိုင်ကိုဖွင့်ပါ",
  "commands.title.preview": "ကြိုတင်မြင်ကွင်းကို ပုံနှိပ်ပါ",
  "commands.title.print": "ပုံနှိပ်",
  "commands.title.setAlternateBrowser": "အခြားဘရိုရှာကို သတ်မှတ်ပါ",
  "configuration.title": "ပုံနှိပ်ခြင်း",
  "print.alternateBrowser.path": "အခြားဘရိုရှာတစ်ခု၏ လုပ်ဆောင်နိုင်သည့်အရာသို့ လမ်းကြောင်း",
  "print.alternateBrowser.enable": "အခြားဘရိုဇာကိုသုံးပါ",
  "print.folder.exclude": "ဖိုင်တွဲ တစ် ခု ၏ အကြောင်းအရာ ကို ပုံနှိပ် သောအခါ ဖယ်ရှား မှု များ အတွက် ဂြိုဟ် ပုံစံ တစ် ခု ။",
  "print.folder.fileNames": "ဖိုင်တွဲတခု၏ အကြောင်းအရာကို ပုံနှိပ်သည့်အခါ အပိုင်းခေါင်းစဉ်များအဖြစ် ဖိုင်အမည်များပါဝင်ပါ",
  "print.folder.include": "ဖိုင်တွဲ အကြောင်းအရာတွင် နမူနာပုံစံ ပါဝင်သည်",
  "print.folder.includeFileList": "ဖိုင်တွဲတစ်ခု၏ အကြောင်းအရာကို ပုံနှိပ်သည့်အခါ ဖိုင်များစာရင်းဖြင့် စတင်ပါ။",
  "print.folder.maxFiles": "ဖိုင်တွဲ ပုံနှိပ်မယ့် ဖိုင်တွေရဲ့ အများဆုံး အရေအတွက် ဖိုင်များများပါသော ဖိုင်တွဲတစ်ခုအတွက် အကျဉ်းချုပ်ကိုသာ ရရှိသည်။",
  "print.folder.maxLines": "စာသားလိုင်းများဖြင့် ဖိုင်အရွယ်အစားအတွက် အထက်ကန့်သတ်ချက်။ ဒီထက်ပိုကြီးတဲ့ ဖိုင်တွေကို လျစ်လျူရှုထားတယ်။",
  "print.general.editorContextMenu.itemPosition": "အယ်ဒီတာ ရှေ့နောက်စကား စာရင်းမှတ်ထဲက 'ပုံနှိပ်' ရဲ့ အနေအထား",
  "print.general.editorTitleMenu.showPreviewIcon": "လှုပ်ရှားနေတဲ့ တည်းဖြတ်ကိရိယာ အထက်က ကိရိယာပေါ်မှာ ပုံနှိပ် အစမ်းကြည့် အိုင်ကွန်ကို ပြပါ",
  "print.general.editorTitleMenu.showPrintIcon": "လှုပ်ရှားနေတဲ့ တည်းဖြတ်ကိရိယာ အထက် ကိရိယာပေါ်မှာ ပုံနှိပ် အိုင်ကွန်ကို ပြပါ",
  "print.general.filepathHeadingForIndividuallyPrintedDocuments": "စာရွက်စာတမ်းတစ်ခုကို တစ်ခုချင်းစီ ပုံနှိပ်သည့်အခါ ဖိုင်လမ်းကြောင်းကို ခေါင်းစဉ်တခုအဖြစ် ပြပါ",
  "print.general.filepathStyleInHeadings": "ဖိုင်လမ်းကြောင်းကို ဖိုင်တစ်ခုစီ၏ အစတွင် ခေါင်းစဉ်တစ်ခုအဖြစ် ပြသနိုင်ပါသည်။ ဖိုင်တွဲတစ်ခု သို့မဟုတ် ရွေးချယ်ထားသောဖိုင်များကို ပုံနှိပ်သည့်အခါ ယင်းကို အသုံးပြုနိုင်သော်လည်း ဖိုင်တစ်ခုချင်းစီအတွက်လည်း အသုံးပြုနိုင်ပါသည်။ လမ်းကြောင်းကို အလုပ်ခွင်နဲ့ ဆက်စပ်နေတာလား ဒါမှမဟုတ် အကြွင်းမဲ့လမ်းကြောင်းအဖြစ် ပြသမလားဆိုတာ ဒီဆက်သွယ်ချက်ကို ဆုံးဖြတ်တယ်။",
  "print.general.filepathStyleInHeadings.absolute": "အကြွင်းမဲ့လမ်းကြောင်း",
  "print.general.filepathStyleInHeadings.relative": "နှိုင်းယှဉ်လမ်းကြောင်း",
  "print.general.logLevel": "မှတ်တမ်း အဆင့် 'Error' သည် အမှား များ ( အလွန် နည်းပါး သော မှတ်တမ်း ) ကို သာ မှတ်တမ်းတင် လိမ့်မည် ၊ ' သတင်း ' သည် အမှား များ ၊ သတိပေးချက် များ နှင့် သတင်း အချက်အလက် များ ကို မှတ်တမ်းတင် လိမ့်မည် ။ 'Debug' သည် ပြဿနာဖြေရှင်းရေးအတွက် ကောင်းသည်။ 'မိုက်မဲ' သည် အားလုံးကို လုံးဝ မှတ်တမ်းတင်မည်ဖြစ်သော်လည်း မှတ်တမ်းဖိုင်သည် လျင်မြန်စွာ ကြီးထွားလာမည်။",
  "print.general.pageBreakBetweenFiles": "ဖိုင်အများအပြားကို ပုံနှိပ်သည့်အခါ ဖိုင်များကြားတွင် စာမျက်နှာဖြတ်ခြင်းကို ခွင့်ပြုပါ။",
  "print.general.useFilepathInDocumentTitle": "စာမျက်နှာ ခေါင်းစီး တွင် အချို့ သော ဘရိုရှာ များ က အသုံးပြု သော အိတ်ခ်ျအိတ်ခ်ျ စာမျက်နှာ ခေါင်းစဉ် ။ စာရွက်စာတမ်း ၏ အစ တွင် ပေါ်ထွက် နိုင် သော ခေါင်းစဉ် အတွက် ၊ ' ဖိုင် လမ်းကြောင်း ကို စာရွက်စာတမ်း ခေါင်းစဉ် အဖြစ် ' ရှု",
  "print.general.useFilepathInDocumentTitle.markdownEnumDescription1": "`filename.ext`",
  "print.general.useFilepathInDocumentTitle.markdownEnumDescription2": "`C:\\...\\folder-containing\\filename.ext` (PDF သိမ်းဆည်းသည့်အခါ အမည်ကို တည်းဖြတ်ရမည်)",
  "print.general.useFilepathInDocumentTitle.markdownEnumDescription3": "အလုပ်ခွင် ဖိုင်တွဲနဲ့ ဆက်စပ်တဲ့ လမ်းကြောင်း တခုပါ",
  "print.markdown.SettleMs": "စာရွက်စာတမ်း ပြောင်းလဲပြီးနောက် ကြိုတင်မပြင်ဆင်မီ စောင့်ဆိုင်းရမည့် မီလီစက္ကန့် အရေအတွက်။ ပုံကြမ်းတွေမှာ အချိန်ကြာဖို့လိုတယ်။ ပုံကြမ်းများကို တည်းဖြတ်နေစဉ် အပူရှိန်ကြိုတင်မြင်ကွင်းကို မသုံးမီ ပုဂ္ဂလိက ခရိုကီဆာဗာတစ်ခုကို တပ်ဆင်ပြီး ၎င်းကိုအသုံးပြုရန် ပုံနှိပ်ကို စီစဉ်ပါ။ အများပြည်သူ ဆာဗာ သည် နှုန်း ကန့်သတ် ထား သည် ။",
  "print.markdown.enableRender": "Markdown ကို ပုံနှိပ် (သို့) အစမ်းကြည့်ဖို့ HTML ပုံစံအတိုင်း ရေးဆွဲပါ",
  "print.markdown.kroki.rejectUnauthorisedTls": "ခွင့်မပြုသော TLS ကို ငြင်းပယ်ပါ",
  "print.markdown.kroki.url": "URL for Kroki diagram rendering service. ဒါက အင်တာနက် ဝန်ဆောင်မှု စံထားချက်ပါ။ [သင့်ကိုယ်ပိုင် တပ်ဆင်သင့်သည်။](https://kroki.io/#install)",
  "print.markdown.stylesheets": "Markdown အတွက် CSS အတွက် URLs (သို့) လမ်းကြောင်းများ။ အလုပ်ခွင် ဆက်စပ်သော လမ်းကြောင်းများအတွက် 'workspace.resource/path/to/your.css' ကိုသုံးပါ။ သို့မဟုတ်လျှင် လမ်းကြောင်းများသည် အခြေခံစာရွက်စာတမ်း ('./my.css' သည် စာရွက်စာတမ်းနှင့် တူညီသော ဖိုင်တွဲထဲတွင်ရှိမည်) သို့မဟုတ် အကြွင်းမဲ့(https://...) နှင့်နှိုင်းယှဉ်သည်။ ဖိုင်တွဲများ သို့မဟုတ် ဖိုင်အများအပြား ရွေးချယ်မှုများအတွက် အကြွင်းမဲ့လမ်းကြောင်းများ သို့မဟုတ် အလုပ်ခွင် ဆက်စပ်သော လမ်းကြောင်းများကို အသုံးပြုပါ။",
  "print.markdown.smartQuotes.enable": "မာ့ခ်ဒေါင်းတွင် စမတ် ကိုးကားချက်များကို အသုံးပြုခွင့်ပြုပါ။",
  "print.markdown.watermark.enable": "မြှုပ်နှံထားသော ရေမွှား စာသားကို ခွင့်ပြု",
  "print.markdown.watermark.text": "ရေးဆွဲထားသော စာရွက်စာတမ်းထဲတွင် အခါအားလျော်စွာ ထည့်သွင်းရန် ရေမွှား စာသားများ",
  "print.plaintext.stylesheets": "URL (သို့) CSS အပိုများအတွက် စာသားများအတွက် လမ်းကြောင်းများ။ အလုပ်ခွင် ဆက်စပ်သော လမ်းကြောင်းများအတွက် 'workspace.resource/path/to/your.css' ကိုသုံးပါ။ သို့မဟုတ်လျှင် လမ်းကြောင်းများသည် အခြေခံစာရွက်စာတမ်း ('./my.css' သည် စာရွက်စာတမ်းနှင့် တူညီသော ဖိုင်တွဲထဲတွင်ရှိမည်) သို့မဟုတ် အကြွင်းမဲ့(https://...) နှင့်နှိုင်းယှဉ်သည်။ ဖိုင်တွဲများ သို့မဟုတ် ဖိုင်အများအပြား ရွေးချယ်မှုများအတွက် အကြွင်းမဲ့လမ်းကြောင်းများ သို့မဟုတ် အလုပ်ခွင် ဆက်စပ်သော လမ်းကြောင်းများကို အသုံးပြုပါ။",
  "print.sourcecode.colourScheme.markdownDescription": "[ပုံစံချပ်ကို အွန်လိုင်းတွင် ရနိုင်ပါသည်။](https://highlightjs.org/demo/) စက္ကူ သည် အဖြူရောင် ဖြစ် သောကြောင့် ' ပေါ့ပါး သော ' ဗားရှင်း များ သာ ကမ်းလှမ်း ခဲ့ သည် ။",
  "print.sourcecode.fontSize": "ဖောင့်အရွယ်",
  "print.sourcecode.lineNumbers": "လိုင်းနံပါတ်များဖြင့် ပုံနှိပ်ပါ",
  "print.sourcecode.lineSpacing": "မျဉ်းများ၏ ဒေါင်လိုက်အကွာအဝေး",
  "print.sourcecode.lineSpacing.double": "နှစ်ကြိမ် အကွာအဝေး",
  "print.sourcecode.lineSpacing.line-and-a-half": "လိုင်း နှင့် တစ်ဝက်",
  "print.sourcecode.lineSpacing.single": "တစ်ချောင်း အကွာအဝေး",
  "print.sourcecode.stylesheets": "အရင်းအမြစ် သင်္ကေတအတွက် အပိုCSS အတွက် URLs (သို့) လမ်းကြောင်းများ။ အလုပ်ခွင် ဆက်စပ်သော လမ်းကြောင်းများအတွက် 'workspace.resource/path/to/your.css' ကိုသုံးပါ။ သို့မဟုတ်လျှင် လမ်းကြောင်းများသည် အခြေခံစာရွက်စာတမ်း ('./my.css' သည် စာရွက်စာတမ်းနှင့် တူညီသော ဖိုင်တွဲထဲတွင်ရှိမည်) သို့မဟုတ် အကြွင်းမဲ့(https://...) နှင့်နှိုင်းယှဉ်သည်။ ဖိုင်တွဲများ သို့မဟုတ် ဖိုင်အများအပြား ရွေးချယ်မှုများအတွက် အကြွင်းမဲ့လမ်းကြောင်းများ သို့မဟုတ် အလုပ်ခွင် ဆက်စပ်သော လမ်းကြောင်းများကို အသုံးပြုပါ။",
  "walkthroughs.howToPrint.title": "ပုံနှိပ်ခြင်းဖြင့် စတင်ပါ",
  "walkthroughs.howToPrint.description": "အရင်းအမြစ် သင်္ကေတ နှင့် စာရွက်စာတမ်း များ အတွက် အယ်ဒီတာ အတွင်း ပုံနှိပ် ခြင်း ကို ရှာဖွေ ပါ ။",
  "walkthroughs.steps.printASelection.title": "ရွေးချယ်ချက်တခုကို ပုံနှိပ်ပါ",
  "walkthroughs.steps.printASelection.media": "assets/print-a-selection.my.md",
  "walkthroughs.steps.printASelection.description": "ရွေးချယ်ထားတဲ့ စာသားအပိုင်းကို ပုံနှိပ်နိုင်ပုံကို သင်ယူပါ။",
  "walkthroughs.steps.printEditorActive.title": "လှုပ်ရှားနေသော တည်းဖြတ်ကိရိယာ၏ အကြောင်းအရာတစ်ခုလုံးကို ပုံနှိပ်ပါ",
  "walkthroughs.steps.printEditorActive.media": "assets/print-entire-content-active-editor.my.md",
  "walkthroughs.steps.printEditorActive.description": "လက်ရှိ လှုပ်ရှား နေ သော တည်းဖြတ် သူ ၏ အကြောင်းအရာ တစ် ခု လုံး ကို ပုံနှိပ် နိုင် ပုံ ကို သင်ယူ ပါ ။",
  "walkthroughs.steps.printMarkdownRendered.title": "Markdown ဖိုင်တခုကို ပုံစံထားသော PDF အဖြစ်ပုံနှိပ်ပါ",
  "walkthroughs.steps.printMarkdownRendered.media": "assets/print-md-as-pdf.my.md",
  "walkthroughs.steps.printMarkdownRendered.description": "Markdown ဖိုင်ကို ကောင်းမွန်သော PDF စာရွက်စာတမ်းအဖြစ် ပုံနှိပ်နိုင်ပုံကို သင်ယူပါ။",
  "walkthroughs.steps.printRemote.title": "အဝေး အလုပ်ခွင် တခုမှ ဖိုင်တခုကို ပုံနှိပ်ပါ",
  "walkthroughs.steps.printRemote.media": "assets/print-remote.my.md",
  "walkthroughs.steps.printRemote.description": "ဝေးလံသောအလုပ်ခွင်မှ ဖိုင်များကို ပုံနှိပ်နိုင်ပုံကို သင်ယူပါ။"
}